#ifndef POLYNOMIAL_STATEMACHINE_H
#define POLYNOMIAL_STATEMACHINE_H


// Конечный автомат для обработки ввода полинома
class StateMachine{
    // Векторы перехода
    int v1[10] = {0,5,-1,3,5,-1,6,-1,8,0}; // ц
    int v2[10] = {0,-1,0,-1,-1,0,0,0,0,-1}; // + или -
    int v3[10] = {1,-1,4,4,-1,7,7,-1,-1,-1}; // *
    int v4[10] = {-1,-1,3,-1,-1,6,-1,8,-1,-1}; // ^
    int v5[10] = {2,2,-1,-1,-1,-1,-1,-1,-1,-1}; // x
    int v6[10] = {5,5,-1,-1,5,-1,-1,-1,-1,-1}; // y
    int v7[10] = {7,7,-1,-1,7,-1,-1,7,-1,-1}; // z
    int v8[10] = {9,-1,-1,-1,-1,-1,-1,-1,-1,-1}; // , или .
    // Конструктор с начальным положением

public:
    int current_state; // Текущее положение
    explicit StateMachine(int start_state = 0);
    void Move(char c); // Передвижение машины по символам
};


#endif
